spec/cassettes/invoice_payment_failed_webhook/creates_a_new_payment_record_if_necessary.yml

---
http_interactions:
- request:
    method: get
    uri: https://api.stripe.com/v1/events/evt_19NxEZ2VpjOYk6TmQLjYsn5Y
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.27.2
      Authorization:
      - Bearer sk_test_XTLCfIQMwKblsxIF1N4i7y1G
      Content-Type:
      - application/x-www-form-urlencoded
      Stripe-Version:
      - '2015-04-07'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.27.2","lang":"ruby","lang_version":"2.3.8 p459 (2018-10-18)","platform":"x86_64-darwin18","engine":"ruby","publisher":"stripe","uname":"Darwin
        kite 18.2.0 Darwin Kernel Version 18.2.0: Fri Oct  5 19:41:49 PDT 2018; root:xnu-4903.221.2~2/RELEASE_X86_64
        x86_64","hostname":"kite"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 21 Nov 2018 03:13:33 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '2394'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_2gV52oafKb81dx
      Stripe-Version:
      - '2015-04-07'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "id": "evt_19NxEZ2VpjOYk6TmQLjYsn5Y",
          "object": "event",
          "api_version": "2015-04-07",
          "created": 1481085647,
          "data": {
            "object": {
              "id": "in_19NwIT2VpjOYk6TmuXa5PSFl",
              "object": "invoice",
              "amount_due": 500,
              "application_fee": null,
              "attempt_count": 1,
              "attempted": true,
              "charge": "ch_19NxEY2VpjOYk6TmlDvEqqAX",
              "closed": false,
              "currency": "usd",
              "customer": "cus_9gwCSjIO6SlmhA",
              "date": 1481082045,
              "description": null,
              "discount": null,
              "ending_balance": 0,
              "forgiven": false,
              "lines": {
                "object": "list",
                "data": [
                  {
                    "id": "sub_9gxjq9c1qGg7BE",
                    "object": "line_item",
                    "amount": 500,
                    "currency": "usd",
                    "description": null,
                    "discountable": true,
                    "livemode": false,
                    "metadata": {
                    },
                    "period": {
                      "start": 1481082006,
                      "end": 1481168406
                    },
                    "plan": {
                      "id": "KVM",
                      "object": "plan",
                      "amount": 500,
                      "created": 1480994112,
                      "currency": "usd",
                      "interval": "day",
                      "interval_count": 1,
                      "livemode": false,
                      "metadata": {
                      },
                      "name": "KVM - Testing",
                      "statement_descriptor": null,
                      "trial_period_days": null
                    },
                    "proration": false,
                    "quantity": 1,
                    "subscription": null,
                    "type": "subscription"
                  }
                ],
                "has_more": false,
                "total_count": 1,
                "url": "/v1/invoices/in_19NwIT2VpjOYk6TmuXa5PSFl/lines"
              },
              "livemode": false,
              "metadata": {
              },
              "next_payment_attempt": 1481344846,
              "paid": false,
              "period_end": 1481082006,
              "period_start": 1480995606,
              "receipt_number": null,
              "starting_balance": 0,
              "statement_descriptor": null,
              "subscription": "sub_9gxjq9c1qGg7BE",
              "subtotal": 500,
              "tax": null,
              "tax_percent": null,
              "total": 500,
              "webhooks_delivered_at": 1481082045,
              "payment": "ch_19NxEY2VpjOYk6TmlDvEqqAX"
            }
          },
          "livemode": false,
          "pending_webhooks": 0,
          "request": null,
          "type": "invoice.payment_failed"
        }
    http_version: 
  recorded_at: Wed, 21 Nov 2018 03:13:29 GMT
recorded_with: VCR 4.0.0
